/*
 Напишете програма, която да пресмята колко километра изминава кола, за която знаем 
    първоначалната скорост (км/ч), 
    времето в минути, след което увеличава скоростта с 10%, 
    второ време, след което намалява скоростта с 5% и 
    времето до края на пътуването. 
 За да намерите разстоянието трябва да превърнете минутите в часове (например 70 минути = 1.1666 часа).
 Да се отпечата на конзолата едно число: изминатите километри, форматирани до втория символ след десетичния знак.
*/

function distance(args) {
    'use strict';

    let speed = Number(args[0]);
    const t1 = Number(args[1]) / 60;
    const t2 = Number(args[2]) / 60;
    const t3 = Number(args[3]) / 60;

    let distance = speed * t1;

    speed = speed * 1.1;
    distance += speed * t2;

    speed = speed * 0.95;
    distance += speed * t3;

    console.log(distance.toFixed(2));

}

distance([90, 60, 70, 80]);     //330.90
distance([140, 112, 75, 190]);     //917.12